# IExternalCommand Methods

---
The IExternalCommand type exposes the following members.
| Name| Description
---|---|---
| Execute| Overload this method to implement and external command within Revit.
Top
#### Reference
IExternalCommand Interface
Autodesk.Revit.UI Namespace